[
    {
        "id": 1,
        "title": "Navigator",
        "image": "navigator",
        "images": [
            {
                "id": 1,
                "name": "navigatorCover"
            },
            {
                "id": 2,
                "name": "logo"
            }
        ],
        "explanation": [
            {
                "title": "Sujet",
                "content": "Il est demandé de travailler sur un code existant et d'évaluer puis d'optimiser les performances, la qualité logicielle, l'ergonomie, la sécurité et le bilan écologique. \nLe code est en PHP et la base de données utilisée est PostgreSQL. Les données géométriques SQL sont fournies au format latitude/longitude par l'IGN, qui fournit également une documentation et un descriptif de contenu. \nLes élèves ont accès aux tables *noeud_commune*, *noeud_routier* et *troncon_route* du schéma *rletud* à l'IUT en tant que `SELECT`. \n\nLes performances du PHP seront analysées avec xDebug, et d'autres manières de mesurer/évaluer les performances tel que : \n- La qualité logicielle, \n- L'ergonomie,\n- La sécurité \n- Le bilan écologique devront être trouvées. \n\nIl est également demandé de rajouter des fonctionnalités au site Web, de déplacer une partie de la logique du site Web côté client et d'utiliser la programmation réactive. Un journal de bord, un compte rendu sur les optimisations réalisées et un rapport final doivent être fournis. Un planning provisoire est également fourni avec des points intermédiaires et une soutenance prévue à la fin."
            },
            {
                "title": "Étapes",
                "content": "Notre premère mission a été d'optimiser l'algorithme qui calcul le plus court chemin. Pour cela, nous avons suivi plusieurs étapes : \n 1. Optimisation de la requête d'accès à la base de donnée. \n 2. Ajout d'une vue matérialisée faisant les calculs au préalable des noeud adjacents. \n3. Modification de l'agorithme côté PHP pour diminuer le nombre de requête serveur en utilisant un système de cache par département. \n 4. Changement vers un algorithme plus optimisé (A*). \n5. Structuration des données avec un BST. \n6. Changement d'architecture de la vue divisant par 2 le nombre de ligne (1 600 000).\n\n Toutes ces modifications nous ont permis d'atteindre une grande rapidité de traitement. Nous sommes passé de 30s pour 0.03 kilomètre à 15s pour 1301.83 kilomètre (Plus grande distance de france)."
            },
            {
                "title": "Évolution",
                "content": "Nous avons décidé d'ajouter des options non demandés tel que l'ajout d'itinéraire supplémentaire permettant de calculer de manière extrêmement rapide la distance la plus courte et l'itinéraire entre maximum 6 villes de france. \n L'itinéraire est affiché sur une map (voir image)."
            }
        ],
        "date": "2023",
        "description": "Navigator consiste en une application qui permet de rechercher l'itinéraire le plus court en termes de distance sur le réseau routier français. L'algorithme A* a été choisi car il est le plus adapté pour cette tâche. L'application affiche une carte montrant l'itinéraire calculé.",
        "languages": [
            {
                "name": "PHP",
                "link": "https://en.wikipedia.org/wiki/PHP"
            },
            {
                "name": "HTML",
                "link": "https://en.wikipedia.org/wiki/HTML"
            },
            {
                "name": "JavaScript",
                "link": "https://en.wikipedia.org/wiki/JavaScript"
            },
            {
                "name": "Postgree",
                "link": ""
            }
        ]
    },
    {
        "id": 2,
        "title": "Portfolio",
        "image": "portfolio",
        "images": [
            {
                "id": 1,
                "name": "portfolioCover"
            }
        ],
        "explanation": [
            {
                "title": "Techonolgie",
                "content": "J'ai choisi d'utiliser Vue.js comme framwork pour le portfolio pour plusieurs raisons.\n Tout d'abord, il est très récent et très apprécié de la communauté. Il est également très léger en comparaison à des framework que j'ai pu utiliser tel qu'Angular."
            }
        ],
        "date": "2023",
        "description": "Il s'agit de mon portfolio codé en Vue.js. Il présente mes compétences et projets de manière interactive et visuelle, avec un design moderne et une interface réactive pour une expérience utilisateur agréable. Le code est organisé en composants réutilisables pour une maintenance facile.",
        "link": "https://github.com/Jasthom/Navigator",
        "languages": [
            {
                "name": "Vue.js",
                "link": ""
            }
        ]
    },
    {
        "id": 3,
        "title": "Votee",
        "image": "votee",
        "images": [
            {
                "id": 1,
                "name": "voteeCover"
            },
            {
                "id": 2,
                "name": "logo"
            }
        ],
        "explanation": [
            {
                "title": "Sujet",
                "content": "Le principe de **Votee** est le suivant :\n1. L'administrateur de l'application désigne l'organisateur d'une nouvelle consultation.\n2. Un organisateur lance une consultation en posant une nouvelle question sur l'application. Il précise le plan du texte attendu pour la réponse. Il désigne l’ensemble des responsables de proposition qui vont écrire des propositions (réponses) concurrentes. Il précise le calendrier : dates de début et de fin de l’écriture des propositions, dates de début et de fin du vote. Il désigne enfin l’ensemble des votants qui vont pouvoir arbitrer entre les propositions. \n3. Chaque responsable de proposition inscrit des co-auteurs. Les co-auteurs rédigent un texte de proposition qui est une réponse possible à la question. Il y a donc plusieurs textes écrits en concurrence par des groupes d’auteurs différents. \n4. Les votants font un choix entre les différentes propositions."
            },
            {
                "title": "Technologie",
                "content": "Pour ce projet, nous avons utilisé uniquement le langage PHP avec une structure MVC. La base de donnée est Oracle."
            },
            {
                "title": "Évolution",
                "content": "Nous avons décidé d'ajouter des extensions tel que : \n- L'ajout de commentaire via un rôle supplémentaire (spécialiste), \n- Lors de l'édition des sections, nous avons ajouté l'intégration du markdown, \n - Fusion de propositions, \n - Ajout d'un système de notifications, \n- Recherche par mots-clés, \n - Gestion des groupes, \n - Gestion des demandes, \n - Historique des questions et des demandes."
            }
        ],
        "date": "2022",
        "description": "Votee est une application web de décision collective ou démocratie participative. Elle permet de gérer un grand ensemble de questions indépendantes les unes des autres, chacune avec des propositions créées par les utilisateurs. À la fin, un vote est organisé pour choisir la proposition gagnante.",
        "link": "https://github.com/Jasthom/Votee",
        "languages": [
            {
                "name": "PHP",
                "link": "https://en.wikipedia.org/wiki/PHP"
            },
            {
                "name": "HTML",
                "link": "https://en.wikipedia.org/wiki/HTML"
            },
            {
                "name": "Tailwind",
                "link": "https://tailwindcss.com/"
            },
            {
                "name": "JavaScript",
                "link": "https://en.wikipedia.org/wiki/JavaScript"
            },
            {
                "name": "Isql+",
                "link": "https://www.oracle.com/database/"
            }
        ]
    },
    {
        "id": 4,
        "title": "Cookab",
        "image": "cookab",
        "images": [
            {
                "id": 1,
                "name": "cookabCover"
            }
        ],
        "explanation": [
            {
                "title": "Sujet",
                "content": "Le but est de proposer un projet qui respecte les principes web modernes avec une **API Rest**. Ce projet permettra, au travers d'une interface graphique développée en **TypeScript / Angular**, d'afficher des ingrédients et des recettes de cuisine récupérés par un backend développé en **Java 17 / Spring** en accédant à une base de données mySql."
            },
            {
                "title": "Technologie",
                "content": "Pour ce projet, nous avons utilisé le langage Java avec le framework **Spring**. La base de donnée est **Mysql**. L'interface graphique est développée en **Angular**. Pour le design, nous avons utilisé le site **figma**."
            },
            {
                "title": "Évolution",
                "content": "Nous avons décidé d'ajouter des fonctions supplémentaire tel que : \n- L'ajout dynamique d'ingrédient et de recettes, \n- La suppression avec des modale de confirmations, \n - La modification, \n - La recherche par mots-clés et par catégorie d'ingrédient et de recette, \n - La gestion des images en base64"
            },
            {
                "title": "Difficultés",
                "content": "La difficulté principale était d'apprendre en peut de temps les framework **Angular** et **Spring**. Cependant, nous avons été suivi par un professeur qui nous a aidé à comprendre les bases de ces technologies."
            }
        ],
        "date": "2022",
        "description": "Cookab est une application de création de recettes de cuisine, qui utilise une API Rest. L'utilisateur peut ajouter dynamiquement des ingrédients, puis créer une recette de cuisine personnalisée avec des étapes, des durées et des quantités spécifiques. L'interface utilisateur est simple et conviviale, permettant à l'utilisateur de naviguer facilement entre les pages et les fonctionnalités.",
        "link": "https://github.com/Jasthom/Cookab",
        "languages": [
            {
                "name": "Angular",
                "link": "https://angular.io/"
            },
            {
                "name": "Spring",
                "link": "https://spring.io/"
            },
            {
                "name": "Mysql",
                "link": "https://www.mysql.com/"
            }
        ]
    },
    {
        "id": 5,
        "title": "Pert",
        "image": "pert",
        "images": [
            {
                "id": 1,
                "name": "pertCover"
            }
        ],
        "explanation": [
            {
                "title": "Sujet",
                "content": "J'ai réalisé un site web pour un client fictif qui est un photographe."
            },
            {
                "title": "Etapes",
                "content": "J'ai réalisé un site web pour un client fictif qui est un photographe."
            },
            {
                "title": "Techonolgie",
                "content": "J'ai utilisé les technologies suivantes :"
            }
        ],
        "date": "2022",
        "description": "Pert est un projet codé en Java, qui utilise l'algorithme Pert pour ordonnancer un projet. L'application permet à l'utilisateur de sauvegarder et de charger facilement les données du projet, ainsi que de visualiser l'ordonnancement détaillé du projet. Il permet de voir clairement l'ordre des tâches, leur durée et leur relation. ",
        "link": "https://github.com/Jasthom/Pert",
        "languages": [
            {
                "name": "Java",
                "link": "https://en.wikipedia.org/wiki/Java_(programming_language)"
            }
        ]
    }
]
